#+TITLE: VRP model evaluator
#+AUTHOR: Alejandra Monzon Penna
#+AUTHOR: Gabriela Arguelles Terron

* Load 

#+BEGIN_SRC lisp :results none
  (load "src/vrp-load.lisp")
#+END_SRC

#+RESULTS:
#+begin_example
Files form lmml: 
Loading lmml/src/gagm.lisp ................................ OK
Loading lmml/src/package.lisp ............................. OK
Loading lmml/src/generic-functions.lisp ................... OK
Loading lmml/src/utilities.lisp ........................... OK
Loading lmml/src/macros.lisp .............................. OK
Loading lmml/src/reader-macros.lisp ....................... OK
Loading lmml/src/infix-to-prefix.lisp ..................... OK
Loading lmml/src/ast-nodes.lisp ........................... OK
Loading lmml/src/basic-language.lisp ...................... OK
Loading lmml/src/code-generation-utils.lisp ............... OK
Loading lmml/src/problem-examples.lisp .................... OK
Loading lmml/src/writer-gmpl.lisp ......................... OK
Loading lmml/src/lmml-case-sensitivity.lisp ............... OK

Files from src
Loading ./src/vrp-function-generator.lisp ................. OK

Package VRP
Loading ./src/vrp-package.lisp ............................ OK

Files form utils: 
Loading ./utils/vrp-random-number-generation.lisp ......... OK
Loading ./utils/vrp-utils.lisp ............................ OK

Files form src
Loading ./src/vrp-utils.lisp .............................. OK
Loading ./src/vrp-characteristics.lisp .................... OK
Loading ./src/vrp-description-definition.lisp ............. OK
Loading ./src/vrp-prerequisites.lisp ...................... OK
Loading ./src/vrp-problem-solution-pair.lisp .............. OK
Loading ./src/vrp-high-level-strategy.lisp ................ OK
Loading ./src/vrp-generate-solution.lisp .................. OK
Loading ./src/vrp-variables-parameters.lisp ............... OK
Loading ./src/vrp-from-high-to-low.lisp ................... OK
Loading ./src/vrp-invoke-function.lisp .................... OK

Package AV-VRP
Loading ./src/av-vrp-package.lisp ......................... OK
#+end_example

